Rails Web Apps/Rails-Music-App/app/views/albums/new.html.erb

    <option disabled selected>-- select a band --</option>
    <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"