Rails Web Apps/Rails-Music-App/app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "year", "location", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "album2"], ["year", "1111-11-11"], ["location", "live"], ["band_id", 1], ["created_at", "2020-11-01 06:53:58.373257"], ["updated_at", "2020-11-01 06:53:58.373257"]]
---
    def create
        @album = Album.new(album_params)
        if @album.save!