Rails Web Apps/Rails-Music-App/app/controllers/bands_controller.rb

    def create
        @band = Band.new(band_params)

        if @band.save!
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "band"], ["created_at", "2020-10-31 05:45:50.415818"], ["updated_at", "2020-10-31 05:45:50.415818"]]

    def destroy
        band = Band.find(params[:id])
        band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 5]]