Rails Web Apps/Rails-Music-App/app/controllers/notes_controller.rb

INSERT INTO "notes" ("body", "user_id", "track_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "track note"], ["user_id", 1], ["track_id", 1], ["created_at", "2020-11-01 11:56:52.726121"], ["updated_at", "2020-11-01 11:56:52.726121"]]
---
    def create
        @note = current_user.notes.new(note_params)

        # fail
        if @note.save!