Rails Web Apps/Rails-Music-App/app/controllers/tracks_controller.rb

    def create
        @track = Track.new(track_params)
        # fail
        if @track.save!
---
INSERT INTO "tracks" ("title", "ord", "album_id", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "track4-1"], ["ord", 0], ["album_id", 3], ["lyrics", "yeyeye  "], ["created_at", "2020-11-01 10:01:53.523775"], ["updated_at", "2020-11-01 10:01:53.523775"]]

    def update
        # fail
        @track = Track.find(params[:id])

        if @track.update(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "ord" = $1, "lyrics" = $2, "updated_at" = $3 WHERE "tracks"."id" = $4  [["ord", 123], ["lyrics", " yeyeye   "], ["updated_at", "2020-11-01 10:23:44.603113"], ["id", 1]]