Rails Web Apps/Rails-Music-App/app/views/tracks/edit.html.erb

SELECT "albums".* FROM "albums"
---
    <option disabled selected>-- select an album --</option>
    <% Album.all.each do |album| %>