Rails Web Apps/Rails-Arts-Sharing/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 2], ["created_at", "2020-10-04 07:50:32.605086"], ["updated_at", "2020-10-04 07:50:32.605086"]]
---
    def create
        artwork_shares = ArtworkShare.new(artwork_share_params)
        if artwork_shares.save

DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]
---
    def destroy
        destroyed_artwork_shares = ArtworkShare.destroy(params[:id])