Rails Web Apps/Rails-Arts-Sharing/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        if params[:user_id]
            user = User.find(params[:user_id])