Rails Web Apps/Rails-Arts-Sharing/app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 1]]
SELECT "comments".* FROM "comments"
---
    def index
        user = params[:user_id]
        artwork = params[:artwork_id]
        if user
            render json: User.find(user).comments
        elsif artwork
            render json: Artwork.find(artwork).comments
        else
            render json: Comment.all