Rails Web Apps/Rails-Arts-Sharing/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        if params[:query]
            render json: users = User.where('username LIKE ?', "%#{params[:query]}%")
        else
            render json: users = User.all

UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "user1xx"], ["email", "email1xx"], ["updated_at", "2020-10-04 04:25:40.713846"], ["id", 1]]
---
    def update
        updated_user = User.update(params[:id], user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        destroyed_user = User.destroy(params[:id])