Rails Web Apps/Rails-Music-App/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "hbZSAuTooXOI7YYePie60A"], ["updated_at", "2020-11-08 06:12:08.487497"], ["id", 98]]
---
    def reset_session_token!
        # self.session_token = self.generate_session_token
        self.session_token = self.class.generate_session_token
        self.save!